{
    "Abhimanyu Apartments, Vasundhara Enclave": 11600000.0,
    "Abul Fazal Enclave Part 1, Okhla": 5183333.333333333,
    "Abul Fazal Enclave Part-II, Okhla": 4133333.3333333335,
    "Adarsh Homes, Dwarka Mor": 3000000.0,
    "Ahinsha Vatika, Ram Nagar, Shahdara": 7300000.0,
    "Alaknanda": 15262500.0,
    "Amar Colony, Lajpat Nagar": 13000000.0,
    "Andheria Mor, Mehrauli": 5700000.0,
    "Anekant Apartment, Vasundhara Enclave": 9800000.0,
    "Anupam Enclave, Saket": 19000000.0,
    "Apna Apartments, Savitri Nagar Village, Sheikh Sarai": 4600000.0,
    "Aravali Tower, Chhattarpur": 5990000.0,
    "Archana Apartment, Paschim Vihar": 8600000.0,
    "Arjun Nagar, Safdarjung Enclave": 5175000.0,
    "Ashirwad Apartments, Dwarka": 15600000.0,
    "Ashirwad Apartments, Dwarka Sector 12": 15500000.0,
    "Ashoka Apartment, Paschim Vihar Block A2": 6500000.0,
    "Ashoka Apartments, Dwarka Sector 12": 15800000.0,
    "Ashoka Enclave Apartment, Dwarka Sector 11": 19200000.0,
    "Balbir Nagar, Shahdara": 4500000.0,
    "Baljit Nagar, Patel Nagar": 1550000.0,
    "Bank Enclave, Laxmi Nagar": 35000000.0,
    "Batla House Project, Batla House, Okhla": 2400000.0,
    "Batla House, Okhla": 3575000.0,
    "Beadon Pura, Karol Bagh How Auctions work? The borrower has the physical possession of the Property. However the lender (Bank) can legally sell the Property. carpet area 148 sqyrd status Ready to Move floor 3 out of 3 floors transaction Resale furnishing Semi-Furnished bathroom 2 balcony 3 ownership Freehold Contact Now Enquire Now Auction By Bank": 6540000.0,
    "Bhagwan Das Nagar, Punjabi Bagh": 9600000.0,
    "Bhorgarh, Narela": 4000000.0,
    "Brijwasi Colony, Mehrauli": 1650000.0,
    "Budh Vihar": 2933333.3333333335,
    "Budh Vihar Phase 1": 2475000.0,
    "Budh Vihar Phase 2": 6100000.0,
    "Budh Vihar super area 50 sqyrd status Ready to Move floor Ground out of 2 floors transaction Resale furnishing Unfurnished facing East car parking 1 Open bathroom 1 balcony 2 ownership Freehold For Sale 2 BHK 50 yrd, 2 side open Ground Floor, First and Second Floor in H Block, Gali No. 04, Near Laxmi Narain Mandir, BudhVihar read more Contact Agent View Phone No. Share Feedback Agent Sahyog Properties 1000+ Buyers Served": 3600000.0,
    "Capital Apartment, Vasundhara Enclave": 15000000.0,
    "Chander Lok Apartment, Dwarka Sector 19": 21000000.0,
    "Chhattarpur": 4477500.0,
    "Chhattarpur Enclave Phase2": 4520000.0,
    "Chittaranjan Park": 22273684.210526317,
    "Chittaranjan Park Block A": 11500000.0,
    "Chittaranjan Park carpet area 1200 sqft status Ready to Move floor 2 out of 4 floors transaction New Property furnishing Semi-Furnished facing North - East overlooking Garden/Park bathroom 3 balcony 2 ownership Freehold Newly Constructed Property Newly Constructed Property brand new 1st floor 3bedroom attach bathrooms stilt car parking modular kitchen air condition prime location c r park read more Contact Agent View Phone No. Share Feedback Nirmala Associates Certified Agent Trusted by Users Genuine Listings 1500+ Buyers Served": 22200000.0,
    "Chittaranjan Park carpet area 270 sqyrd status Ready to Move floor 2 out of 4 floors transaction Resale furnishing Furnished facing North - East overlooking Garden/Park, Main Road car parking 5 Open bathroom 4 balcony 3 ownership Freehold 3 Side Open, Fully ventilated, Close to Market, Above Bank and 24 x 7 ATM because of which good security. Elite Neighbor hood. Very good for Rental Income. Also can be used for commercial Office Purpose by Advocates. read more Contact Owner View Phone No. Share Feedback Owner Mayur Mayur Aggarwal": 30000000.0,
    "Chopra Apartment, Dwarka Sector 23": 13850000.0,
    "Citizen Apartment, Rohini Sector 13": 15500000.0,
    "Common Wealth Games Village, Commonwealth Games Village 2010": 37020000.0,
    "Commonwealth Games Village 2010": 37600000.0,
    "Crescent Apartments, Dwarka Sector 18": 14900000.0,
    "DDA Flats Block A, Dilshad Garden": 14400000.0,
    "DDA Flats Mansarovar Park, Seelampur, Shahdara": 7500000.0,
    "DDA Flats Pocket 1 Sector A9, Narela": 3800000.0,
    "DDA Flats Pocket 3, Narela": 2000000.0,
    "DDA Flats Pocket 6 Sector A10, Narela": 2600000.0,
    "DDA Flats Pocket O, Dilshad Garden": 3000000.0,
    "DDA Flats Sector E Pocket 1, Vasant Kunj": 13766666.666666666,
    "DDA Flats Vasant Kunj, Vasant Kunj": 24250000.0,
    "DDA Flats Vasant Kunj, Vasant Kunj Sector C": 23500000.0,
    "DDA Flats Vasant Kunj, Vasant Kunj Sector D": 23500000.0,
    "DDA Flats, Sarita Vihar, Mathura Road carpet area 1150 sqft status Ready to Move floor 3 out of 3 floors transaction Resale furnishing Semi-Furnished facing North - East overlooking Main Road society DDA Flats car parking 2 Open bathroom 2 balcony 3 ownership Freehold 2 BHK flat available for sale in sarita vihar excellent interiors flooring in all bedrooms complete wood work modular kitchen beautiful bathrooms extremely well maintained ample parking space read more Contact Agent View Phone No. Share Feedback Lavish Associates Certified Agent Trusted by Users Genuine Listings Market Knowledge": 10800000.0,
    "DDA Janta Flats, Tikri Khurd Sector B2, Narela": 1800000.0,
    "DDA Lig Flats, Narela": 2437500.0,
    "DDA Lig Flats, Paschim Vihar": 6300000.0,
    "DDA Lig Flats, Paschim Vihar carpet area 45 sqyrd status Ready to Move floor 4 out of 4 floors transaction Resale furnishing Semi-Furnished facing East overlooking Garden/Park, Main Road society DDA Lig Flats bathroom 1 balcony 1 ownership Freehold East Facing Property Expected price for the Flat is kept at 45 Lac. This is a 1 bedroom apartment present in DDA Lig Flats, Paschim Vihar. It measures an area of 45 Sq-m. It is on 4 floor out of 4 floors in the tower and is also well ventilated. The Flat has 1 washroom and also has 1 spacious balcony. read more Contact Owner View Phone No. Share Feedback Owner Anil": 4500000.0,
    "DDA MIG Flats Prasad Nagar Phase 2, Prasad Nagar, Karol Bagh": 14250000.0,
    "DDA Mig Flat, Prasad Nagar, Karol Bagh": 16000000.0,
    "DDA Pocket 1, Vasant Kunj Sector D": 24000000.0,
    "DDA Pocket E, Dilshad Garden": 4200000.0,
    "DDA Pocket H, Narela": 1800000.0,
    "DDA Pocket I, Dilshad Garden": 9500000.0,
    "DDA Pocket JK, Dilshad Garden": 6500000.0,
    "DDA RPS Flats, Mansarowar Park, Shahdara": 5800000.0,
    "DLF Capital Greens, Moti Nagar, Kirti Nagar ( 1 km from New Moti Nagar, Kirti Nagar)": 44000000.0,
    "DLF Capital Greens, New Moti Nagar, Kirti Nagar": 26563636.363636363,
    "DLF Capitals Phase III, Shivaji Park, Punjabi Bagh": 52500000.0,
    "Delhi Homes Yojana, Dwarka Sector 24": 5890000.0,
    "Delhi Homes, Rohini Sector 24": 4000000.0,
    "Deshbandhu Apartments, Kalkaji": 16050000.0,
    "Deshbandhu Apartments, Kalkaji carpet area 1300 sqft status Ready to Move floor 3 out of 4 floors transaction Resale furnishing Unfurnished facing North - East overlooking Garden/Park, Main Road society Deshbandhu Apartments car parking 1 Covered, 1 Open bathroom 2 balcony 2 ownership Freehold Third Floor with terrace 3 bhk builder floor apartment with 2 attached bathrooms located in kalkaji Deshbandu apartment . all water and electrical connections installed, very spacious drawing room , 2 balconies in front and rear each dedicated parking spot for 1 car. extra parking space available for additional cars, Immediately for sale , read more Contact Agent View Phone No. Share Feedback Agent Bhawani Realtors": 13500000.0,
    "Dev Nagar, Karol Bagh": 5900000.0,
    "Diamond Heights Multi Estate, Najafgarh": 2940000.0,
    "Dilshad Colony, Dilshad Garden": 6469230.769230769,
    "Dilshad Garden": 6626000.0,
    "Dwarka": 24000000.0,
    "Dwarka Mor": 3325000.0,
    "Dwarka Sector 16B": 6800000.0,
    "Dwarka Sector 3 carpet area 400 sqft status Ready to Move floor 1 out of 4 floors transaction New Property furnishing Semi-Furnished facing West overlooking Main Road bathroom 1 balcony 1 ownership Freehold Newly Constructed Property 1BHK freehold property , reserved parking, ample space for visitor parking, bathrooms with modern facilities, complete light in all room, wooden wardrobes in bedrooms, separate electric & water meter connection, separate water tank at roof, electronic door lock system with intercom facility, wall to wall POP work, fall ceiling work in all rooms, royal paint work in all rooms, 24X7 running water, branded electric fittings, modular kitchen with electronic chimney, marble vitrified tile flooring, near to metro station, well connected to main road ect. 80 to 90 home loan available. Ready to move read more Contact Agent View Phone No. Share Feedback Agent S.B. Associates 4000+ Buyers Served": 1850000.0,
    "Dwarka Sector 4": 14800000.0,
    "E2 Vasant Kunj, Vasant Kunj": 7000000.0,
    "Friends Colony East, New Friends Colony": 38000000.0,
    "Gandhi Nagar, Shahdara": 13725000.0,
    "Ganga Apartment Sector D Pocket 6, Vasant Kunj": 21000000.0,
    "Geeta Colony": 9280000.0,
    "Geetanjali Enclave Project, Geetanjali Enclave, Malviya Nagar": 52500000.0,
    "Gobind Apartment, Vasundhara Enclave": 11000000.0,
    "Godrej South Estate, Okhla": 25883333.333333332,
    "Godrej South Estate, Okhla Phase 1": 24866666.666666668,
    "Gorakh Park West, Shahdara": 4500000.0,
    "Govindpuri Extension, Kalkaji": 6150000.0,
    "Greater Kailash 1": 30000000.0,
    "Greater Kailash 4 Nri Colony": 36500000.0,
    "Green Heavens Apartment, Aashirwaad Chowk, Dwarka": 16500000.0,
    "Guru Angad Nagar West, Laxmi Nagar": 2533333.3333333335,
    "Guru Harikishan Nagar, Paschim Vihar": 27250000.0,
    "Hans Apartments, Vishwas Nagar, Shahdara": 9000000.0,
    "Hauz Khas": 39600000.0,
    "Hauz Khas Enclave, Hauz Khas": 27500000.0,
    "Hindon Apartment, Vasundhara Enclave": 10000000.0,
    "Indra Park Palam, Manglapuri": 2033333.3333333333,
    "Indraprastha Apartment, Dwarka Sector 12": 11400000.0,
    "J R Designers Floors, Rohini Sector 24": 7864516.129032258,
    "Jamia Nagar, Okhla": 1800000.0,
    "Janakpuri Block A3": 51000000.0,
    "Jyoti Colony, Shahdara": 4500000.0,
    "Kailash Apartments, Aashirwaad Chowk, Dwarka": 10700000.0,
    "Kailash Colony, Greater Kailash": 32505555.555555556,
    "Kalindi Colony, Maharani Bagh, New Friends Colony": 50000000.0,
    "Kalkaji": 11500000.0,
    "Kalkaji Extention": 8933333.333333334,
    "Kalkaji super area 1000 sqft status Ready to Move floor 2 out of 3 floors transaction Resale furnishing Semi-Furnished facing North - West overlooking Garden/Park, Main Road car parking 1 Covered, 1 Open bathroom 2 balcony 2 ownership Freehold Very beautiful 3 bedroom with attached washroom , drawing dining , modular kitchen , ac , servant room , power backup, powder room, separate underground and overhead water tanks, walking distance to market , easy access to ring road . For more details and site visit please contact cosmo properties. read more Contact Agent View Phone No. Share Feedback Agent Zee Associates": 18000000.0,
    "Kalkaji super area 800 sqft status Ready to Move floor 3 out of 4 floors transaction Resale furnishing Semi-Furnished facing North - West overlooking Garden/Park, Main Road car parking 1 Open bathroom 2 balcony 2 ownership Freehold 2 bhk flat for sale in kalkaji this is third floor with 2 bed room and bathrooms very peace full location and posh. The Summer Fields School is considered as among the best school of New Delhi and is located just beside to this property. Within the range of 4-5km, you will find some of the well-equipped hospitals which include AIMS Hospital and Moolchand Hospital.for more information about this flat please call me feel free. read more Contact Agent View Phone No. Share Feedback Agent Rose Estate 100+ Buyers Served": 8000000.0,
    "Kanti Nagar East, Shahdara": 35000000.0,
    "Karol Bagh": 11516666.666666666,
    "Karol Bagh carpet area 1600 sqft status Ready to Move floor 3 out of 3 floors transaction New Property furnishing Semi-Furnished facing East overlooking Garden/Park, Main Road car parking 1 Covered, 1 Open bathroom 3 balcony 2 ownership Freehold Near to Karol Bagh Metro station...................................... Its a very peaceful location ....................................................................................................................... read more Contact Agent View Phone No. Share Feedback Agent S R B Properties": 24000000.0,
    "Karuna Vihar Apartment, Dwarka": 16000000.0,
    "Khanpur, Madangir": 2400000.0,
    "Khirki extension, Malviya Nagar": 5200000.0,
    "Kiran Garden, Uttam Nagar": 4000000.0,
    "Kishangarh, Vasant Kunj": 5000000.0,
    "Krishan Kunj, Laxmi Nagar": 3500000.0,
    "Krishna Nagar Block A": 2500000.0,
    "Krishna Nagar-Safdarjung Enclave": 10500000.0,
    "Kunj Vihar Apartment, Dwarka Sector 12": 17400000.0,
    "Kushwaha Homes, Uttam Nagar": 3300000.0,
    "LIC Colony, Paschim Vihar": 24500000.0,
    "LNT Apartments, Dwarka": 10500000.0,
    "Lajpat Nagar 1": 9150000.0,
    "Lajpat Nagar 2": 18500000.0,
    "Lajpat Nagar 3": 28805555.555555556,
    "Lalita Park, Laxmi Nagar": 3950000.0,
    "Laxmi Nagar": 5390909.090909091,
    "Laxmi Nagar carpet area 1000 sqft status Ready to Move floor 1 out of 4 floors transaction Resale furnishing Furnished bathroom 3 balcony 1 It's a 1st floor Builder Floor Apartment in a building of total 4 floors. The age of construction for this Builder Floor Apartment is between 10 to 15 years. The location has easy access to, Dena Bank (0 km ), Delhi Convent School (0 km ), DDA Market (0 km ) and Nirman Vihar Metro Station (2 km ). read more Contact Owner View Phone No. Share Feedback Owner Vipul Jain": 12500000.0,
    "Laxmi Nagar super area 450 sqft status Ready to Move floor 3 out of 4 floors transaction New Property furnishing Semi-Furnished facing East overlooking Main Road bathroom 2 balcony 1 ownership Freehold Newly Constructed Property East Facing Property This Builder Floor Apartment at 3rd faces East & overlooks Main Road offering a beautiful view from the house. with airy interiors. The type of ownership is Freehold. The Builder Floor Apartment is newly constructed. Bank loans available from LIC Housing Finance, Kotak Mahindra Bank, Indiabulls. Flooring of type Marble covers maximum part of the house. The location has easy access to, Dena Bank (0 km ), Delhi Convent School (0 km ), DDA Market (0 km ) and Nirman Vihar Metro Station (2 km ). read more Contact Owner View Phone No. Share Feedback Owner Sonia": 2550000.0,
    "MTNL Employees House Welfare Society, Dwarka Sector 24": 4447500.0,
    "Maharani Bagh, New Friends Colony": 50000000.0,
    "Mahavir Enclave": 3434285.714285714,
    "Mahavir Enclave Part 1": 3937500.0,
    "Mahavir Enclave Part 3": 1950000.0,
    "Mahavir Enclave carpet area 565 sqft status Ready to Move floor Ground out of 1 floor transaction Resale furnishing Unfurnished facing East car parking 1 Covered bathroom 2 balcony 1 ownership Freehold East Facing Property This Freehold Builder Floor Apartment is located at Ground floor in a building of total 1 floors. The age of construction for this apartment Builder Floor Apartment is Less than 5 years. High quality flooring of types Granite are available in different rooms. read more Contact Owner View Phone No. Share Feedback Owner Adesh Sah": 3500000.0,
    "Mahesh Apartment, Vasundhara Enclave": 12500000.0,
    "Malviya Nagar": 13175000.0,
    "Malviya Nagar carpet area 100 sqyrd status Ready to Move floor 2 out of 3 floors transaction Resale furnishing Semi-Furnished facing North overlooking Garden/Park, Main Road car parking 2 Open bathroom 3 balcony 2 ownership Freehold It's a Corner three story building, located in South Delhi. Amenities like Market, Schools, Hospitals, Parks, Gyms, Study Centers, Temple are all around. Very Close to Malviya Nagar Metro and Haus Khas Metro Station. Centerlize place to live. Whether you go to Gurgaon or Noida Or to other parts of the city, commuting from here is very easy. read more Contact Owner View Phone No. Share Feedback Owner Rohit": 12500000.0,
    "Mandakini Enclave Project, Kalkaji": 27500000.0,
    "Manglapuri, Sultanpur": 7425000.0,
    "Mansarowar Park, Shahdara": 11400000.0,
    "Maujpur, Shahdara": 1550000.0,
    "Mayur Apartment, Rohini Sector 9": 11000000.0,
    "MeeraBai Apartment, Dwarka Sector 5": 16500000.0,
    "Mehrauli": 4800000.0,
    "Mehrauli carpet area 1250 sqft status Ready to Move floor Ground out of 8 floors transaction Resale furnishing Semi-Furnished facing East overlooking Main Road car parking 1 Covered bathroom 2 balcony 3 ownership Freehold The flat located are very good condition and well developed area. The flat area are very spaciable. This flat balcony view is very best society very neat and clean. read more Contact Agent View Phone No. Share Feedback Agent Bharti Real Estate 100+ Buyers Served": 6500000.0,
    "Mehrauli carpet area 1300 sqft status Ready to Move floor 2 out of 4 floors transaction New Property furnishing Semi-Furnished facing East overlooking Garden/Park, Main Road car parking 2 Covered bathroom 3 balcony 2 ownership Freehold 3 bhk flat with attached washroom, modular kitchen, IInd floor, one car and one bike parking, lift, gated society, security, cctv camera, water backup. read more Contact Agent View Phone No. Share Feedback Agent India Bhoomi": 7000000.0,
    "Mianwali Nagar, Paschim Vihar": 30000000.0,
    "Mitya Homes, Dwarka Mor": 5800000.0,
    "Mohan Garden, Razapur Khurd": 4800000.0,
    "Mohinder Apartments, Dwarka": 31500000.0,
    "Mohinder Apartments, Dwarka Sector 12": 30000000.0,
    "Narela": 2576666.6666666665,
    "Narela Mandi": 1500000.0,
    "Narela Sector A5": 1000000.0,
    "Narela Sector A9": 4600000.0,
    "Narmada Apartment, Alaknanda": 18250000.0,
    "Narmada Apartment, Alaknanda carpet area 1400 sqft status Ready to Move floor Ground out of 3 floors transaction Resale furnishing Furnished facing North - East overlooking Garden/Park, Main Road society Narmada Apartment car parking 1 Open bathroom 3 balcony 1 ownership Freehold Near Alaknanda Main Market & Greater Kailash Metro Station. A very good 3 bhk flat for sale in rwa Narmada Apartment, delhi south. It is a superb property and offers an excellent view. The flat is unfurnished. It promises a comfortable stay. It is feng shuivaastu compliant, which is considered to bring positive energy. The appeal of the flat has been increased with the availability of a pipedGa. Indeed, the society too has multiple facilities for enjoyment, such as club housecommunity center and fitness centregym etc. It also has rain water harvesting system. It has a super builtUp area of 180 sq. Yards. read more Contact Agent View Phone No. Share Feedback Agent Sulabh Estate": 18000000.0,
    "Nav Kairali Apartment, Dwarka Sector 3": 14500000.0,
    "Navbharat Apartment, Paschim Vihar Block B1": 13000000.0,
    "Naveen Shahdara, Shahdara": 8150000.0,
    "Neelachal, Dwarka Sector 5": 20500000.0,
    "Nehru Enclave, Kalkaji": 21750000.0,
    "New Delhi Apartment, Vasundhara Enclave": 12000000.0,
    "New Friends Colony": 45000000.0,
    "New Friends Colony Floors, New Friends Colony": 52500000.0,
    "New Jyoti Apartments, Aashirwaad Chowk, Dwarka": 16200000.0,
    "New Manglapuri, Sultanpur": 6644444.444444444,
    "New Moti Nagar, Kirti Nagar": 17590000.0,
    "New Uttam Nagar, Uttam Nagar": 5400000.0,
    "Nilgiri Apartment, Alaknanda": 16433333.333333334,
    "PNB Employees Apartment, Aashirwaad Chowk, Dwarka": 14900000.0,
    "Pal Mohan Apartments, Punjabi Bagh": 18500000.0,
    "Panchsheel Vihar, Sheikh Sarai": 4660000.0,
    "Partap Homes, Bhagwati Vihar, Uttam Nagar": 5510000.0,
    "Paschim Vihar": 11520000.0,
    "Paschim Vihar Block A2": 23100000.0,
    "Paschim Vihar Block B4": 26500000.0,
    "Paschim Vihar How Auctions work? The borrower has the physical possession of the Property. However the lender (Bank) can legally sell the Property. carpet area 780 sqft status Ready to Move floor Ground out of 3 floors transaction Resale furnishing Unfurnished facing West bathroom 2 balcony 1 ownership Freehold Contact Now Enquire Now Auction By Bank": 8770000.0,
    "Paschim Vihar carpet area 850 sqft status Ready to Move floor 2 out of 4 floors transaction Resale furnishing Unfurnished facing North overlooking Garden/Park bathroom 3 balcony 1 ownership Freehold If you want to live a contended, pollution-free and peaceful life with your family and children, here is the once in a lifetime opportunity awaiting your attention!! Presenting a 3BHK ready to move flat up for sale in Paschim Vihar, which is becoming a dream residential area for its ability to provide a slice of authentic New Delhi city life. Property SpecificationsWell-knitted and planned on the super area of 900 sq ft is this 2bhk flat where the owner enjoys the complete rights of the freehold ownership. In a low-rise building of four-floors, this impressive infrastructure is positioned on the second floor, hence the residents can experience the greatest possible cross ventilation and natural sunlight.Though the age of construction is between 15-20 years, this north-facing flat is perfectly maintained and features 3 spacious bedrooms, 2 bathrooms, 2 airy balconies, a dining room, a living room, and a kitchen. All the bedrooms are adorned with decorative wardrobes offered with enough space for storage of clothes and other valuables.The attached toilet is designed in Indian fashion which is mounted-up with a geyser where you can enjoy a hot water bath, while the bathroom available for common use fashioned in the western genre.Further, an eye-catching view of the lush green garden is visible from the two well-aligned balconies where you can enjoy a hot cup of tea, where one balcony is connected to the bedroom, while the other balcony opens to the lobby. Bedecked with a granite countertop, a piped gas connection, and a chimney, the contemporarily designed modular kitchen is also provided with a wash area and also sufficient space for fridge.The entire flat is polished up with the good quality tiles which are easy to install and can be quite pleasant and comfortable underfoot.FacilitiesKeeping in mind the convenience of the residents, some of the basic facilities such as an unrestricted supply of water, and power backup with invertor. Additionally, one open parking space for 1 vehicle read more Contact Owner Share Feedback Owner Yogeet": 5700000.0,
    "Paschimpuri, Paschim Vihar": 5100000.0,
    "Patel Nagar East, Patel Nagar": 25571428.57142857,
    "Patel Nagar South, Patel Nagar": 8200000.0,
    "Patel Nagar West": 11930000.0,
    "Pawittra Apartment, Vasundhara Enclave": 16500000.0,
    "Prasad Nagar, Karol Bagh": 5000000.0,
    "Prashant Vihar, Rohini": 10500000.0,
    "Press Enclave Society, Saket": 26000000.0,
    "Project Commonwealth Games Village 2010, Akshardham Temple": 40250000.0,
    "Project Commonwealth Games Village 2010, Commonwealth Games Village 2010": 41740000.0,
    "Project Gangotri Enclave, Alaknanda": 21000000.0,
    "Project Gangotri Enclave, Gangotri Enclave, Alaknanda": 19000000.0,
    "Project Paryavaran Complex, Saket": 12500000.0,
    "Punjabi Bagh": 32500000.0,
    "Punjabi Bagh East": 21750000.0,
    "Punjabi Bagh Enclave, Madipur, Punjabi Bagh": 7800000.0,
    "Punjabi Bagh Enclave, Punjabi Bagh": 32500000.0,
    "Punjabi Bagh Enclave, Punjabi Bagh West": 7500000.0,
    "Punjabi Bagh Enclave, Shivaji Park, Punjabi Bagh": 25000000.0,
    "Punjabi Bagh Extension, Punjabi Bagh": 22375000.0,
    "Punjabi Bagh West": 27750000.0,
    "Punjabi Basti, Patel Nagar": 12000000.0,
    "Pushkar Enclave, Paschim Vihar": 15000000.0,
    "RWA Flats, Saket": 28166666.666666668,
    "Raghubarpura, Shahdara": 10200000.0,
    "Rajgarh Colony, Shahdara": 17500000.0,
    "Ram Nagar Extension, Shahdara": 4000000.0,
    "Ram Nagar, Shahdara": 3800000.0,
    "Rohini Sector 14": 25000000.0,
    "Rohini Sector 16": 17000000.0,
    "Rohini Sector 18 carpet area 40 sqm status Ready to Move floor 2 out of 4 floors transaction Resale furnishing Furnished facing East overlooking Main Road car parking 2 Open bathroom 1 balcony 1 ownership Freehold East Facing Property It an LIG three side corner flat in second floor, having full scope of expansion. interior decorated with 2 textured wall , kajaria tiles , fully modular kitchen, branded bathroom and toilet fittings, LED panel, ac in one bedroom, false ceiling in entire flat.south facing unobstructed view balcony. It was all renovated only 2.5 yrs back so every thing is in brand new condition. read more Contact Owner View Phone No. Share Feedback Owner Pramod": 5300000.0,
    "Rohini Sector 19": 21000000.0,
    "Rohini Sector 20": 6400000.0,
    "Rohini Sector 21": 6800000.0,
    "Rohini Sector 22": 11500000.0,
    "Rohini Sector 23": 11566666.666666666,
    "Rohini Sector 24": 9820000.0,
    "Rohini Sector 24 carpet area 650 sqft status Ready to Move floor 4 out of 4 floors transaction New Property furnishing Semi-Furnished facing East overlooking Garden/Park, Main Road car parking 1 Open bathroom 2 balcony 1 ownership Freehold Newly Constructed Property Newly Constructed Property East Facing Property 2BHK Newly build property for Sale. A House is waiting for a Friendly Family to make it a lovely home.So please come and make his house feel alive once again. read more Contact Agent View Phone No. Share Feedback Garima properties Certified Agent Trusted by Users Genuine Listings Market Knowledge": 6200000.0,
    "Rohini Sector 25": 6566666.666666667,
    "Rohini Sector 25 carpet area 660 sqft status Ready to Move floor 2 out of 4 floors transaction New Property furnishing Semi-Furnished facing North overlooking Garden/Park, Main Road car parking 1 Open bathroom 2 balcony 1 ownership Freehold Newly Constructed Property Newly Constructed Property Near by Ryan international school 2BHK Located on the Ground Floor of a four story building with open parking the flat measure 720 Sq Ft the property is located in a green and plush sector with common parks opposite every lane and bus and auto stand nearby. its situated 1.5 km from the metro station and walkable distance from shopping distance from shopping complex. read more Contact Agent View Phone No. Share Feedback Know your Certified Agent CRISIL Rating No of Employees 9 Kulwant & Company Certified Agent Trusted by Users Genuine Listings 5500+ Buyers Served": 4700000.0,
    "Rohini Sector 5": 12000000.0,
    "Rohini Sector 8 How Auctions work? The borrower has the physical possession of the Property. However the lender (Bank) can legally sell the Property. super area 32 sqm status Ready to Move floor 1 transaction Resale furnishing Semi-Furnished Contact Now Enquire Now Auction By": 3310000.0,
    "Rohtash Nagar, Shahdara": 2900000.0,
    "SB Residency, Dwarka Mor": 4800000.0,
    "Sadbhawna CGHS, Aashirwaad Chowk, Dwarka": 27500000.0,
    "Safdarjung Development Area, Hauz Khas": 29166666.666666668,
    "Safdarjung Enclave": 29225000.0,
    "Safdarjung Enclave carpet area 1100 sqft status Ready to Move floor Ground out of 4 floors transaction Resale furnishing Unfurnished facing North - East overlooking Garden/Park, Main Road car parking 1 Covered, 1 Open bathroom 3 balcony 3 ownership Freehold if you are searching for your dream house, congratulation. you're not so far from your destiny. we got unbeatable ground floor in b-block safdarjung enclave for sale. it is in 150 yds. It has 3 large king sized bedroom attached bathroom with Jacuzzi and roof top shower with all other fittings. it has modular kitchen with all needed facility. it has 3 big balcony with amazing out side view. it has 1 servant quarter also. it has 1 reserved car parking with gated society. It has 24*7 water supply with full power backup. for more information contact us at once because it can be your dream house. read more Contact Agent View Phone No. Share Feedback Crisil Silver Agent Sagar Home Developers Pvt. Ltd. 1000+ Buyers Served": 25000000.0,
    "Safdarjung Enclave carpet area 1450 sqft status Ready to Move floor 3 out of 4 floors transaction Resale furnishing Semi-Furnished facing North - East overlooking Garden/Park, Main Road car parking 1 Covered, 1 Open bathroom 3 balcony 2 ownership Freehold Park facing builder floor apartment available for sale in safderjung enclave, 3 bedroom with attached bathroom, drawing dinning, modular kitchen. the property is on the top floor of a four storey building with terrace right, servant quarter, 1 car parking in stilt. read more Contact Agent View Phone No. Share Feedback Agent Delhi Homes Realty 1000+ Buyers Served": 37500000.0,
    "Safdarjung Enclave carpet area 290 sqyrd status Ready to Move floor 2 out of 3 floors transaction Resale furnishing Semi-Furnished facing West overlooking Main Road car parking 2 Open bathroom 4 balcony 3 ownership Freehold Opposite Deer Park.The property comes with independent Terrace. The area is centrally located and close to ring road which allows easy acess to all other areas.Renowned Delhi Lawn Tennis Association is within 10 minutes walking distance.Green park market is walkable distance. read more Contact Owner View Phone No. Share Feedback Owner Hemant pajankar": 42500000.0,
    "Safdarjung Enclave super area 2200 sqft status Ready to Move floor 2 out of 4 floors transaction New Property furnishing Semi-Furnished facing South overlooking Main Road car parking 3 Covered, 2 Open bathroom 4 balcony 3 ownership Freehold Newly Constructed Property Wide Road 450 Yards 2nd floor brand new 4 bhk attached bathrooms with full lighted and ventilated house.Most Valuable DealSEE TO BELIEVE read more Contact Agent View Phone No. Share Feedback Crisil Bronze Agent Panchsheel Homes 500+ Buyers Served": 52500000.0,
    "Saket": 32183333.333333332,
    "Saket Court Residential Complex, Saket": 23000000.0,
    "Sanskriti Apartment, Rohini Sector 28": 3400000.0,
    "Saptrishi Apartment, Rohini Sector 23": 7600000.0,
    "Sarita Vihar Pocket B": 13500000.0,
    "Sarita Vihar Pocket F": 14000000.0,
    "Sarva Priya Apartment, Hauz Khas": 36250000.0,
    "Sarva Priya Apartment, Hauz Khas carpet area 1700 sqft status Ready to Move floor 1 out of 7 floors transaction Resale furnishing Semi-Furnished facing North - East overlooking Garden/Park society Sarva Priya Apartment car parking 1 Covered, 1 Open bathroom 3 balcony 2 ownership Freehold desperarte sale ,its clear tile, proper cross ventilation ,proper an matter for one week ,crystle sunlight found, and air,ICIC BANK LOAN APPROVAL, good to see , have lucky chance to get such a reraly rare property read more Contact Agent View Phone No. Share Feedback Agent New Capital Properties 1000+ Buyers Served": 36500000.0,
    "Satyam Apartment, Vasundhara Enclave": 14000000.0,
    "Savitri Nagar Village, Sheikh Sarai": 7250000.0,
    "Seelampur, Shahdara": 4800000.0,
    "Shahdara": 6000000.0,
    "Shahdara How Auctions work? The borrower has the physical possession of the Property. However the lender (Bank) can legally sell the Property. super area 852 sqft status Ready to Move transaction Resale ownership Freehold bathroom 2 Contact Now Enquire Now Auction By": 2670000.0,
    "Shanti Mohalla, Shahdara": 35000000.0,
    "Shastri Park, Shahdara": 8475000.0,
    "Sheikh Sarai Phase 1": 17353333.333333332,
    "Sheikh Sarai Phase 2": 7000000.0,
    "Shivalik, Malviya Nagar": 30000000.0,
    "Shivnam Apartment, Shahdara": 3300000.0,
    "Shri Agrasen Apartment, Dwarka Sector 7": 14200000.0,
    "Shubh Niketan, Paschim Vihar": 21000000.0,
    "Siddhartha Heights, Dwarka Sector 24": 1900000.0,
    "Sidharth Enclave, Kilokri, Ring Road": 16000000.0,
    "Sitaram Bazar, Chandni Chowk": 6200000.0,
    "Sukhdev Vihar, Okhla": 21870000.0,
    "Sultanpur": 4928571.428571428,
    "Sultanpur Extension": 2200000.0,
    "Sultanpur carpet area 1100 sqft status Ready to Move floor 1 out of 4 floors transaction Resale furnishing Semi-Furnished overlooking Main Road car parking 1 Covered bathroom 2 balcony 2 ownership Freehold 2 bhk flat available in sultanpur, near metro station, loan facility available, with registry, all the modern facilities are variable, with car parking, near market, fully ventilated. read more Contact Agent View Phone No. Share Feedback Agent Delhi Dream 3500+ Buyers Served": 2800000.0,
    "Sunder Apartments, Sunder Vihar, Paschim Vihar": 18000000.0,
    "Sunny Valley Apartments, Dwarka": 17200000.0,
    "Taimoor Enclave, New Friends Colony carpet area 2800 sqft status Ready to Move floor 2 out of 3 floors transaction Resale furnishing Semi-Furnished facing East overlooking Garden/Park society Taimoor Enclave car parking 2 Covered, 1 Open bathroom 4 balcony 2 ownership Freehold Two floor of the house is available for sale SECOND AND THIRD FLOOR EXTRA made, provision for LIFT can be provided by the OWNER .DDA FLATS of TAIMOOR ENCLAVE, NEAR GURUDWARA, NEW FRIENDS COLONY, SOUTH DELHI , HOUSE IS ON THE SECOND FLOOR have 3 bed room and 2 wash room and and same on the Third Floor, URGENT SALE, BROKER EXCUSE. read more Contact Agent View Phone No. Share Feedback Agent Delhi Homes 100+ Buyers Served": 29500000.0,
    "Taj Enclave, Khairatabad": 21500000.0,
    "Tara Apartment, Alaknanda carpet area 1400 sqft status Ready to Move floor 2 out of 3 floors transaction Resale furnishing Furnished facing North - East overlooking Garden/Park society Tara Apartment car parking 1 Covered, 1 Open bathroom 3 balcony 4 ownership Freehold Near Alaknanda Main Market, Jamia Humderd University & Batra hospital. A very good 3 bhk flat for sale in rwa Tara Apartment, delhi south. It is a superb property and offers an excellent view. The flat is unfurnished. It promises a comfortable stay. It is feng shuivaastu compliant, which is considered to bring positive energy. The appeal of the flat has been increased with the availability of a pipedGa. Indeed, the society too has multiple facilities for enjoyment, such as club housecommunity center and fitness centregym etc. It also has rain water harvesting system. It has a super builtUp area of 180 sq. Yards. Other f read more Contact Agent View Phone No. Share Feedback Agent Sulabh Estate": 19000000.0,
    "The Amaryllis, Karol Bagh": 27312500.0,
    "The Elite Spire, Dwarka Sector 21": 3700000.0,
    "Uttam Nagar": 3200000.0,
    "Uttam Nagar Floors, Uttam Nagar": 4370000.0,
    "Uttam Nagar West": 2100000.0,
    "Uttam Nagar carpet area 550 sqft status Ready to Move transaction New Property furnishing Semi-Furnished facing East overlooking Main Road bathroom 2 balcony 1 ownership Freehold Newly Constructed Property Newly Constructed Property East Facing Property 2bhk fully furnished flats available for sale at uttam nagar, the flat is fully loaded, one singal wall texture in all bedrooms, modular kitchen, LED pannel in drawing room, wardrobes in bedroom read more Contact Agent View Phone No. Share Feedback Pranita Developers Pvt. Ltd. Certified Agent Trusted by Users Genuine Listings 100+ Buyers Served": 2600000.0,
    "Vasant Kunj": 18833333.333333332,
    "Vasant Kunj Sector A": 25000000.0,
    "Vasant Kunj Sector B": 40000000.0,
    "Vasant Kunj Sector C": 27333333.333333332,
    "Vasant Kunj Sector D": 7500000.0,
    "Vasundhara Enclave": 9675000.0,
    "Vijay Enclave, Mahavir Enclave": 2200000.0,
    "Vijay Vihar, Rohini": 4500000.0,
    "Vikram Vihar, Lajpat Nagar": 22625000.0,
    "Vinoba Puri, Lajpat Nagar": 8900000.0,
    "Virat Residency, Dwarka Mor": 4620000.0,
    "Vishwas Nagar, Shahdara": 6500000.0,
    "Yamuna Apartment, Alaknanda": 15000000.0,
    "Yamuna Vihar, Shahdara": 11912000.0,
    "Zakir Nagar, New Friends Colony": 1500000.0,
    "mind. The space is airy, is well located and can be easily customized as per the needs. Prime facilities are easily accessible from this place with Government Girls Senior Secondary School No 2 (0 km ). Other key neighbourhood are B Block Market (0 km ). read more Contact Owner View Phone No. Share Feedback Owner vinod kumar": 9000000.0
}